perf/ping1.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections


  phases:
    - name: Plain0
      duration: 60
      arrivalRate: 20
    - name: Ramp0
      duration: 60
      arrivalRate: 20
      rampTo: 40
    - name: Plain1
      duration: 60
      arrivalRate: 40
    - name: Ramp1
      duration: 60
      arrivalRate: 40
      rampTo: 80
    - name: Plain2
      duration: 60
      arrivalRate: 80



scenarios:
  - name: Ping (/)
    flow:
      - get:
          url: '/'