perf/root3.yaml
config:
  environments:
    first:
      target: 'http://localhost:5555/first/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    second:
      target: 'http://localhost:5555/second/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  #Se asume 0.5 de LOOP
  #El endpoint deberia aguantarse esta demanda
  phases:
    - name: Plain0
      duration: 60
      arrivalRate: 8
    - name: Ramp
      duration: 60
      arrivalRate: 8
      rampTo: 12
    - name: Plain1
      duration: 60
      arrivalRate: 12
    - name: Ramp1
      duration: 60
      arrivalRate: 12
      rampTo: 16
    - name: Plain2
      duration: 60
      arrivalRate: 16



scenarios:
  - name: Root
    flow:
      - get:
          url: '/'